БСП_ВА/src/Catalogs/ОбработчикиОчередиЗаданий/ОбработчикиОчередиЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбработчикиОчередиЗаданий</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Методы</name>
    <attributes>
      <name>Метод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БСП_ВА/src/Catalogs/ОбработчикиОчередиЗаданий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция РасписаниеПоУмолчанию() Экспорт
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 60;
	
	Возврат Расписание;
	
КонецФункции

// Обработчик обновления
//
Процедура ПеренестиДанныеИзРегламентногоЗадания() Экспорт
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.УдалитьОбработкаОчередиЗаданийБТС);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Для Каждого Задание Из НайденныеЗадания Цикл
		Ссылка = Справочники.ОбработчикиОчередиЗаданий.ПолучитьСсылку(Новый УникальныйИдентификатор(Задание.Ключ));
		ОбработчикОчередиЗаданий = Ссылка.ПолучитьОбъект();
		Если ОбработчикОчередиЗаданий <> Неопределено Тогда
			ОбработчикОчередиЗаданий.Использование = Задание.Использование;
			ОбработчикОчередиЗаданий.Расписание = Новый ХранилищеЗначения(Задание.Расписание);
			ОбработчикОчередиЗаданий.ОбменДанными.Загрузка = Истина;
			ОбработчикОчередиЗаданий.Записать();
		КонецЕсли;
		Задание.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
